#define _GNU_SOURCE /* For REG_RIP */

#include "jit.h"

#include "bbc.h"
#include "opdefs.h"
#include "util.h"

#include <assert.h>
#include <err.h>
#include <limits.h>
#include <signal.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ucontext.h>
#include <unistd.h>

static const size_t k_guard_size = 4096;
static const int k_jit_bytes_per_byte = 256;
static const int k_jit_bytes_shift = 8;
static const int k_jit_bytes_mask = 0xff;
static void* k_jit_addr = (void*) 0x20000000;
static void* k_utils_addr = (void*) 0x80000000;
static const size_t k_utils_size = 4096;
static const size_t k_utils_debug_offset = 0;
static const size_t k_utils_regs_offset = 0x100;
static const size_t k_utils_jit_offset = 0x200;

static const int k_offset_util_jit = 0;
static const int k_offset_util_regs = 8;
static const int k_offset_util_debug = 16;

static const int k_offset_reg_rip = 24;
static const int k_offset_reg_a_eax = 28;
static const int k_offset_reg_x_ebx = 32;
static const int k_offset_reg_y_ecx = 36;
static const int k_offset_reg_s_esi = 40;
static const int k_offset_reg_pc = 44;
static const int k_offset_reg_x64_flags = 46;
static const int k_offset_reg_6502_flags = 47;
static const int k_offset_irq = 48;

static const int k_offset_debug_callback = 56;
static const int k_offset_jit_callback = 64;
static const int k_offset_read_callback = 72;
static const int k_offset_write_callback = 80;

static const int k_offset_debug = 88;
static const int k_offset_bbc = 96;
static const int k_offset_jit_ptrs = 104;

static const unsigned int k_jit_flag_debug = 1;
static const unsigned int k_jit_flag_merge_ops = 2;
static const unsigned int k_jit_flag_self_modifying = 4;
static const unsigned int k_jit_flag_dynamic_operand = 8;
static const unsigned int k_jit_flag_no_rom_fault = 16;

enum {
  k_a = 1,
  k_x = 2,
  k_y = 3,
  k_set = 4,
};

/* k_a: PLA, TXA, TYA, LDA */
/* k_x: LDX, TAX, TSX */
/* k_y: LDY, TAY */
static const unsigned char g_nz_flag_pending[58] = {
  0    , 0    , 0    , k_set, k_set, 0    , 0    , 0    ,
  0    , k_set, k_set, k_set, k_set, 0    , 0    , 0    ,
  k_set, k_set, 0    , 0    , 0    , 0    , 0    , k_set,
  k_a  , k_set, 0    , 0    , 0    , 0    , 0    , k_set,
  k_a  , 0    , k_a  , 0    , k_y  , k_a  , k_x  , k_y  ,
  k_x  , 0    , 0    , k_x  , k_set, k_set, k_set, k_set,
  k_set, k_set, 0    , 0    , k_set, k_set, 0    , k_set,
  0    , 0    ,
};

static const unsigned char g_nz_flags_needed[58] = {
  0, 0, 1, 0, 0, 1, 1, 0,
  1, 0, 0, 0, 0, 1, 0, 0,
  0, 0, 0, 1, 1, 1, 1, 0,
  0, 0, 1, 0, 0, 0, 0, 0,
  0, 1, 0, 0, 0, 0, 0, 0,
  0, 1, 0, 0, 0, 0, 0, 0,
  0, 0, 1, 0, 0, 0, 0, 0,
  1, 0,
};

struct jit_struct {
  /* Utilities called by JIT code. */
  /* Must be at 0. */
  unsigned char* p_util_jit;    /* 0   */
  unsigned char* p_util_regs;   /* 8   */
  unsigned char* p_util_debug;  /* 16  */

  /* Registers. */
  unsigned int reg_rip;         /* 24  */
  unsigned int reg_a_eax;       /* 28  */
  unsigned int reg_x_ebx;       /* 32  */
  unsigned int reg_y_ecx;       /* 36  */
  unsigned int reg_s_esi;       /* 40  */
  uint16_t reg_pc;              /* 44  */
  unsigned char reg_x64_flags;  /* 46  */
  unsigned char reg_6502_flags; /* 47  */
  unsigned char irq;            /* 48  */

  /* C callbacks called by JIT code. */
  void* p_debug_callback;       /* 56  */
  void* p_jit_callback;         /* 64  */
  void* p_read_callback;        /* 72  */
  void* p_write_callback;       /* 80  */

  /* Structures reeferenced by JIT code. */
  void* p_debug;                /* 88  */
  struct bbc_struct* p_bbc;     /* 96 */
  unsigned int jit_ptrs[k_bbc_addr_space_size]; /* 104 */

  /* Fields not referenced by JIT'ed code. */
  unsigned int jit_flags;
  unsigned char* p_mem;
  unsigned char* p_jit_base;
  unsigned char* p_utils_base;
  struct util_buffer* p_dest_buf;
  struct util_buffer* p_seq_buf;
  struct util_buffer* p_single_buf;
  unsigned char has_code[k_bbc_addr_space_size];
  unsigned char compiled_opcode[k_bbc_addr_space_size];
};

static size_t
jit_emit_int(unsigned char* p_jit_buf, size_t index, ssize_t offset) {
  assert(offset >= INT_MIN);
  assert(offset <= INT_MAX);
  p_jit_buf[index++] = offset & 0xff;
  offset >>= 8;
  p_jit_buf[index++] = offset & 0xff;
  offset >>= 8;
  p_jit_buf[index++] = offset & 0xff;
  offset >>= 8;
  p_jit_buf[index++] = offset & 0xff;

  return index;
}

static size_t
jit_emit_intel_to_6502_carry(unsigned char* p_jit, size_t index) {
  /* setb r14b */
  p_jit[index++] = 0x41;
  p_jit[index++] = 0x0f;
  p_jit[index++] = 0x92;
  p_jit[index++] = 0xc6;

