#include "jit.h"

#include "bbc.h"
#include "debug.h"
#include "opdefs.h"
#include "util.h"

#include <assert.h>
#include <err.h>
#include <limits.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

static const size_t k_addr_space_size = 0x10000;
static const size_t k_guard_size = 4096;
static const int k_jit_bytes_per_byte = 256;
static const int k_jit_bytes_shift = 8;
static void* k_jit_addr = (void*) 0x20000000;
static void* k_utils_addr = (void*) 0x80000000;
static const size_t k_utils_size = 4096;
static const size_t k_utils_debug_offset = 0;

static const int k_offset_util_debug = 24;
static const int k_offset_debug = 32;
static const int k_offset_debug_callback = 40;
static const int k_offset_bbc = 48;
static const int k_offset_read_callback = 56;
static const int k_offset_write_callback = 64;
static const int k_offset_interrupt = 72;

struct jit_struct {
  unsigned char* p_mem;        /* 0  */
  unsigned char* p_jit_base;   /* 8  */
  unsigned char* p_utils_base; /* 16 */
  unsigned char* p_util_debug; /* 24 */
  void* p_debug;               /* 32 */
  void* p_debug_callback;      /* 40 */
  struct bbc_struct* p_bbc;    /* 48 */
  void* p_read_callback;       /* 56 */
  void* p_write_callback;      /* 64 */
  uint64_t interrupt;          /* 72 */
};

static size_t
jit_emit_int(unsigned char* p_jit_buf, size_t index, ssize_t offset) {
  assert(offset >= INT_MIN);
  assert(offset <= INT_MAX);
  p_jit_buf[index++] = offset & 0xff;
  offset >>= 8;
  p_jit_buf[index++] = offset & 0xff;
  offset >>= 8;
  p_jit_buf[index++] = offset & 0xff;
  offset >>= 8;
  p_jit_buf[index++] = offset & 0xff;

  return index;
}

static size_t
jit_emit_intel_to_6502_zero(unsigned char* p_jit, size_t index) {
  /* sete r13b */
  p_jit[index++] = 0x41;
  p_jit[index++] = 0x0f;
  p_jit[index++] = 0x94;
  p_jit[index++] = 0xc5;

  return index;
}

static size_t
jit_emit_intel_to_6502_negative(unsigned char* p_jit, size_t index) {
  /* sets r14b */
  p_jit[index++] = 0x41;
  p_jit[index++] = 0x0f;
  p_jit[index++] = 0x98;
  p_jit[index++] = 0xc6;

  return index;
}

static size_t
jit_emit_intel_to_6502_carry(unsigned char* p_jit, size_t index) {
  /* setb r12b */
  p_jit[index++] = 0x41;
  p_jit[index++] = 0x0f;
